[
  {
    "id": 1,
    "name": "TechFest 2025",
    "date": "2025-08-15",
    "time": "10:00 AM - 6:00 PM",
    "venue": "Main Auditorium",
    "category": "academic",
    "department": "Computer Science",
    "description": "TechFest 2025 is the largest annual technology festival at our university, bringing together over 500 students, faculty, and industry professionals from across the region. This comprehensive event features cutting-edge project exhibitions, intense coding competitions, 48-hour hackathons, and keynote presentations from leading tech industry experts. Participants can attend hands-on workshops covering AI, blockchain, IoT, and cybersecurity, while exploring an innovation showcase featuring 20+ student startup projects. The event includes dedicated networking sessions with recruiters from major tech companies, career counseling booths, and a startup pitch competition with a total prize pool of $50,000. TechFest also hosts a technology expo with 30+ industry partners, live coding demonstrations, and interactive VR/AR experiences. This is the perfect platform for students to showcase their technical skills, connect with potential employers, and gain insights into the latest technological trends shaping our digital future.",
    "organizer": "CS Department",
    "image": "https://i0.wp.com/whataftercollege.com/wp-content/uploads/2018/03/Techfest-featured-Image.jpg?fit=800%2C418",
    "status": "completed",
    "registrationRequired": false,
    "capacity": "No limit",
    "attendees": 450
  },
  {
    "id": 2,
    "name": "AI & Machine Learning Workshop",
    "date": "2025-10-20",
    "time": "10:00 AM - 5:00 PM",
    "venue": "Lab 5, CS Block",
    "department": "Computer Science",
    "category": "technical",
    "description": "The AI & Machine Learning Workshop 2025 is an intensive 2-day program designed for students seeking to advance their careers in artificial intelligence and data science. This comprehensive workshop covers 8 modules ranging from fundamental concepts to advanced applications, utilizing industry-standard tools including Python, TensorFlow, PyTorch, Scikit-learn, and Keras. Participants will build real-world projects including facial recognition systems, intelligent chatbots, stock price prediction models, and recommendation engines. The program features hands-on sessions with 5 AI experts from Google, Microsoft, and leading tech startups, who will share practical insights and emerging trends in AI development. Students will work on capstone projects, receive personalized feedback, and gain access to exclusive datasets. Upon completion, participants receive industry-recognized certificates and internship opportunities with partner companies. The workshop also includes career guidance sessions, portfolio development workshops, and networking events with AI professionals and researchers.",
    "organizer": "CS Department",
    "image": "https://cdn.iplocation.net/assets/images/blog/featured/ai-ml-real-world-applications.png",
    "status": "upcoming",
    "registrationRequired": true,
    "capacity": 180,
    "attendees": 150
  },
  {
    "id": 3,
    "name": "Physics Research Symposium",
    "date": "2025-02-18",
    "time": "09:30 AM - 5:00 PM",
    "venue": "Seminar Hall 2",
    "department": "Physics",
    "category": "technical",
    "description": "The Physics Research Symposium 2025 is the premier scientific event of the year, convening over 200 researchers, faculty, and students from 15 universities across the region. This comprehensive symposium focuses on three key areas: quantum mechanics and quantum technology, optics and laser physics, and astrophysics and cosmology. The program features 12 keynote presentations from internationally renowned professors, 45 student research posters, and 8 specialized discussion panels. Distinguished speakers include Dr. Sarah Johnson from CERN (Switzerland) discussing particle physics discoveries and Professor Michael Chen from MIT (USA) presenting on quantum computing applications. Students will have opportunities to present their research findings, receive expert feedback, and explore potential collaborations. The symposium includes interactive lab demonstrations, equipment exhibitions, and career development sessions for aspiring physicists. Special sessions cover emerging fields like quantum materials, gravitational wave detection, and space exploration technologies.",
    "organizer": "Physics Department",
    "image": "https://www.cedarville.edu/images/default-source/event/research-symposium/research-symposium-logo.jpg?sfvrsn=8c7008e7_0",
    "status": "completed",
    "registrationRequired": true,
    "capacity": 260,
    "attendees": 245
  },
  {
    "id": 4,
    "name": "Astronomy Observation Night",
    "date": "2025-10-05",
    "time": "07:00 PM - 10:00 PM",
    "venue": "Physics Observatory",
    "department": "Physics",
    "category": "cultural",
    "description": "Astronomy Observation Night 2025 is a spectacular 3-hour event held at the Physics Observatory, featuring 5 professional-grade telescopes including a 14-inch Schmidt-Cassegrain and a 10-inch Newtonian reflector. Guided by 8 astronomy experts from the Physics Department and local astronomy clubs, participants will learn to identify 20 major constellations, observe Jupiter and its moons, Saturn with its famous rings, and the Orion Nebula. The program includes 3 educational lectures on astronomical phenomena, a screening of Carl Sagan's 'Cosmos' documentary, and hands-on star mapping activities. Weather permitting, attendees will have the rare opportunity to observe distant galaxies, star clusters, and planetary nebulae. The event also features astrophotography demonstrations, telescope operation workshops, and discussions about space exploration missions. This unique experience combines scientific learning with cultural appreciation of the cosmos, making astronomy accessible to students from all academic backgrounds.",
    "organizer": "Physics Department",
    "image": "https://2.bp.blogspot.com/-Wqo87J4lKH0/Wc2t8ab1EvI/AAAAAAAAWBY/WrFJn2wtXtMKNgQLFppH8LN-ycHS-aVTQCLcBGAs/s1600/observatorium.jpg",
    "status": "upcoming",
    "registrationRequired": false,
    "capacity": "No limit",
    "attendees": 450
  },
  {
    "id": 5,
    "name": "Art & Culture Expo",
    "date": "2025-04-15",
    "time": "10:00 AM - 6:00 PM",
    "venue": "Exhibition Hall",
    "department": "Fine Arts",
    "category": "cultural",
    "description": "The Art & Culture Expo 2025 is the largest creative festival of the year, spanning 3 days and featuring over 200 artworks from Fine Arts students. The exhibition includes 5 main sections: painting with 80 oil, acrylic, and watercolor works; sculpture with 30 pieces in clay, wood, and metal; photography with 50 artistic images; music with 15 live performances; and theater with 8 short plays. The event features 10 guest artists from other universities and 5 interactive workshops on painting techniques, pottery making, and photography. Over 1,000 visitors including students, faculty, and local community members will experience live performances, interactive art installations, and cultural exchange activities. The expo includes a student art market, cultural food stalls, and collaborative art projects. Special highlights include a digital art showcase, multimedia installations, and performances by the university's award-winning choir and orchestra. This celebration of creativity aims to foster cultural exchange and highlight the diverse artistic voices within our university community.",
    "organizer": "Fine Arts Department",
    "image": "https://www.ticket2u.com.my/ticket2u/site/news/assets/img/2025/exhibition-my.png",
    "status": "completed",
    "registrationRequired": false,
    "capacity": "No limit",
    "attendees": 450
  },
  {
    "id": 6,
    "name": "Annual Painting Competition",
    "date": "2025-08-22",
    "time": "09:00 AM - 5:00 PM",
    "venue": "Fine Arts Studio",
    "department": "Fine Arts",
    "category": "cultural",
    "description": "The Annual Painting Competition 2025 with the theme 'Green Future' brings together over 150 participants from 8 universities across the region, including fine arts students and art enthusiasts. This intensive 8-hour competition features three categories: oil painting, watercolor, and acrylic. The judging panel consists of 5 art professionals, including renowned environmental artist Sarah Martinez and Professor David Chen from the National Art University. Participants must create works that express their vision of sustainability, environmental consciousness, and harmony between humanity and nature. The competition offers substantial prizes: 1st place ($10,000), 2nd place ($5,000 each for two winners), 3rd place ($3,000 each for three winners), and 5 honorable mentions. Winning artworks will be displayed in the university gallery for 2 months and featured in the prestigious 'Creative Campus' art magazine. The event includes live painting demonstrations, art supply vendors, and networking opportunities with gallery owners and art collectors.",
    "organizer": "Fine Arts Department",
    "image": "https://media.dpssrinagar.com/v2/media/2023/06/Painting-Competition.jpg",
    "status": "completed",
    "registrationRequired": false,
    "capacity": "No limit",
    "attendees": 450
  },
  {
    "id": 7,
    "name": "Business Summit 2025",
    "date": "2025-09-05",
    "time": "09:00 AM - 5:00 PM",
    "venue": "Management Block Auditorium",
    "department": "Business Administration",
    "category": "technical",
    "description": "Business Summit 2025 is the largest economic event of the year, convening over 650 delegates including 20 CEOs from leading corporations, 50 successful entrepreneurs, and 580 students from business schools. This comprehensive 8-hour summit features 4 main discussion panels: 'The Future of Fintech and Digital Banking', 'Marketing in the AI Era', 'Leadership in Digital Transformation', and 'Sustainable Entrepreneurship'. The program includes a special 15-minute startup pitch session where students present their business ideas, with the top 3 pitches receiving opportunities to meet with investors. The summit features 2 hours of networking with 20 booths from partner companies, offering internship and job opportunities for students. Distinguished speakers include John Smith, CEO of a unicorn startup, and Lisa Wang, CMO of a multinational corporation. The event also includes career counseling sessions, resume workshops, and one-on-one mentoring opportunities with industry leaders.",
    "organizer": "BBA Department",
    "image": "https://uk.cruworldwine.com/media/wysiwyg/investment_research_pdf/1,5,3,2,4,9,7,6/business-leader-1.png",
    "status": "completed",
    "registrationRequired": true,
    "capacity": 650,
    "attendees": 620
  },
  {
    "id": 8,
    "name": "Marketing Fair",
    "date": "2025-11-02",
    "time": "10:00 AM - 5:00 PM",
    "venue": "Open Exhibition Grounds",
    "department": "Business Administration",
    "category": "cultural",
    "description": "The Marketing Fair 2025 is the largest interactive marketing event of the year, held at the Open Exhibition Grounds with 30 booths from Business Administration student groups. Each booth displays creative marketing campaigns, innovative branding strategies, and real-world advertising prototypes. The fair features 5 main competitions: 'Best Social Media Campaign', 'Most Creative Advertisement Design', 'Comprehensive Marketing Plan', 'Viral Video Advertisement', and 'Pitch Presentation'. The judging panel includes 8 marketing experts from leading companies like Coca-Cola, Samsung, and major advertising agencies. Over 900 visitors including students, faculty, and representatives from 15 partner companies will attend. Special highlights include 5 outstanding projects receiving paid internship opportunities with sponsoring companies and a total prize pool of $25,000. The fair also features live campaign launches, interactive product demonstrations, and networking sessions with marketing professionals and potential employers.",
    "organizer": "BBA Department",
    "image": "https://cbx-prod.b-cdn.net/COLOURBOX15151126.jpg?width=800&height=800&quality=70",
    "status": "upcoming",
    "registrationRequired": false,
    "capacity": "No limit",
    "attendees": 450
  },
  {
    "id": 9,
    "name": "Inter-Department Football Final",
    "date": "2025-06-10",
    "time": "03:00 PM - 06:00 PM",
    "venue": "University Sports Ground",
    "department": "Sports Council",
    "category": "sports",
    "description": "The Inter-Department Football Final 2025 is the most anticipated sports event of the year, held at the University Sports Ground with a capacity of 1,200 spectators. This championship match features the top 2 teams after 3 months of qualifying rounds with 12 teams from different departments. The final showcases 22 of the best players, trained by former professional footballers. The event includes an opening ceremony with 50 cheerleaders, live commentary from professional sports commentators, and a halftime show featuring 30 student performers. Fans are encouraged to wear their department colors and create an electric atmosphere with flags, banners, and enthusiastic cheering. The match will be live-streamed on the university website and social media, expected to reach over 5,000 viewers. The winning team receives the championship trophy, gold medals, and a $10,000 prize. The event also includes pre-match entertainment, food vendors, and post-match celebrations with the winning team.",
    "organizer": "Sports Council",
    "image": "https://www.creativefabrica.com/wp-content/uploads/2022/10/27/Football-tournament-illustration-Graphics-43508908-1.png",
    "status": "completed",
    "registrationRequired": false,
    "capacity": "No limit",
    "attendees": 450
  },
  {
    "id": 10,
    "name": "Annual Sports Day",
    "date": "2025-09-25",
    "time": "08:00 AM",
    "venue": "Athletics Stadium",
    "department": "Sports Council",
    "category": "sports",
    "description": "The Annual Sports Day 2025 is the largest sporting event of the year, spanning 10 hours at the Athletics Stadium with over 1,500 students from 15 departments participating. The program includes 25 competitive events: 8 track and field events (100m, 200m, 400m, 800m, 1500m races, high jump, long jump, shot put), 5 swimming events, 4 football matches, 3 volleyball games, 2 badminton tournaments, and 3 traditional sports competitions. The event features 50 professional referees, 100 volunteer assistants, and 20 medical staff. The day includes an opening ceremony with a parade of 15 department teams, an awards ceremony with 150 gold, silver, and bronze medals, and 15 championship trophies for outstanding departments. Special highlights include 3 national athletes serving as ambassadors and demonstrating advanced techniques. The event promotes sportsmanship, teamwork, and physical fitness while celebrating athletic excellence across all departments.",
    "organizer": "Sports Council",
    "image": "https://static.vecteezy.com/system/resources/previews/024/844/121/non_2x/national-sports-day-illustration-with-sportsperson-from-different-sport-in-flat-cartoon-hand-drawn-landing-page-background-templates-vector.jpg",
    "status": "upcoming",
    "registrationRequired": false,
    "capacity": "No limit",
    "attendees": 450
  },
  {
    "id": 11,
    "name": "Green Chemistry Seminar",
    "date": "2025-03-25",
    "time": "10:00 AM",
    "venue": "Chemistry Block",
    "department": "Chemistry",
    "category": "technical",
    "description": "The Green Chemistry Seminar 2025 focuses on eco-friendly chemical processes and sustainable laboratory practices, spanning 7 hours with 220 delegates including 15 chemistry experts from research institutes, 50 faculty members, and 155 students. The program features 8 keynote presentations on biodegradable materials, renewable energy, pollution control, and wastewater treatment technologies. Special highlights include 5 hands-on demonstrations on biofuel production, composite material creation from agricultural waste, and water quality analysis using green methods. The seminar also features an exhibition of 20 student research posters and 3 specialized discussion panels on environmental policies. Distinguished speakers include Dr. Emily Rodriguez from the National Chemistry Institute and Professor James Wilson from Stanford University. The event aims to raise awareness about chemistry's role in building a sustainable future and create opportunities for collaborative research partnerships between academia and industry.",
    "organizer": "Chemistry Department",
    "image": "https://lh4.googleusercontent.com/proxy/zW_cegLxaZ6fVo8KHbEvvAdP1m3dTn3CL4awjZZHRKJkwyoUwID2QDpUWYXrDdZVh-l5s24ZqeWcJAp90eJLrKN_PMvqmfsdzwTu1K4U7cLYZNfAoJeohHIBIACpXz46-2UDOgNl99M=w1200-h630-p-k-no-nu",
    "status": "completed",
    "registrationRequired": true,
    "capacity": 220,
    "attendees": 210
  },
  {
    "id": 12,
    "name": "Chemistry Fair",
    "date": "2025-09-18",
    "time": "10:00 AM",
    "venue": "Exhibition Hall",
    "department": "Chemistry",
    "category": "technical",
    "description": "The Chemistry Fair 2025 is the largest interactive science event of the year, held at the Exhibition Hall with 25 booths from Chemistry Department students. Each booth displays exciting experiments, interactive models, safe chemical reactions, and research posters on diverse chemistry topics. The fair includes 3 main sections: Interactive Experiment Zone with 15 safe experiments for visitors, Model Exhibition Area with 20 3D molecular models, and Research Poster Gallery with 30 posters from student projects. Over 400 visitors including students from other departments, high school students, and local community members will attend. Special highlights include 5 major experiment demonstrations every hour, featuring color-changing reactions, colored smoke displays, and chemical fireworks. The fair also features chemistry-themed games, molecular gastronomy demonstrations, and career counseling sessions with chemistry professionals. This celebration of scientific curiosity aims to make chemistry accessible and demonstrate its beauty in everyday life.",
    "organizer": "Chemistry Department",
    "image": "https://static.vecteezy.com/system/resources/previews/000/098/099/original/free-chemistry-vector.jpg",
    "status": "upcoming",
    "registrationRequired": true,
    "capacity": 400,
    "attendees": 0
  },
  {
    "id": 13,
    "name": "Medical Innovations Conference",
    "date": "2025-04-12",
    "time": "09:00 AM",
    "venue": "Medical College Auditorium",
    "department": "Medicine",
    "category": "technical",
    "description": "The Medical Innovations Conference 2025 convenes over 700 delegates including 50 specialist doctors, 100 medical researchers, and 550 medical students from 10 universities. This comprehensive 8-hour conference features 6 main discussion panels on biotechnology, digital health, robotic surgery, AI in diagnosis, personalized medicine, and nanotechnology in treatment. The program includes 12 keynote presentations from renowned physicians, featuring Professor Dr. Sarah Johnson from Johns Hopkins Hospital (USA) on robotic heart surgery and Dr. Michael Chen from City General Hospital on AI applications in cancer diagnosis. The conference also features an exhibition of 40 student research posters, 15 medical technology booths, and 3 hands-on workshops on new medical devices. Special sessions cover telemedicine, medical robotics, and precision medicine applications. The event serves as a platform to inspire innovation, share cutting-edge research, and improve healthcare delivery through technology and collaboration.",
    "organizer": "Medical Faculty",
    "image": "https://imcpakistan.org/wp-content/uploads/2023/11/imc-logo.png",
    "status": "completed",
    "registrationRequired": true,
    "capacity": 700,
    "attendees": 680
  },
  {
    "id": 14,
    "name": "Free Health Checkup Camp",
    "date": "2025-07-02",
    "time": "08:30 AM",
    "venue": "Community Health Center",
    "department": "Medicine",
    "category": "cultural",
    "description": "The Free Health Checkup Camp 2025 is a comprehensive community outreach program organized by 200 medical students and 20 faculty members from the Medical Department. The camp operates at the Community Health Center with 15 specialized examination rooms, providing free general checkups, blood tests, blood pressure monitoring, blood glucose testing, and basic health consultations. The program includes 8 health awareness sessions on nutrition, personal hygiene, cardiovascular disease prevention, diabetes management, and cancer screening. The camp features 10 specialist doctors from local hospitals, 50 nurses, and 30 pharmacists. The event is expected to serve 450 community members, including elderly citizens, children, and families in need. Special services include 200 free medication packages and 100 specialized consultations for critical cases. The camp also provides health education materials, vaccination information, and referrals to specialized medical facilities. This event reflects the university's commitment to social responsibility and public health improvement in the local community.",
    "organizer": "Medical Faculty",
    "image": "https://azbigmedia.com/wp-content/uploads/2023/11/Free-Medical-Camp.jpg",
    "status": "completed",
    "registrationRequired": false,
    "capacity": "No limit",
    "attendees": 450
  },
  {
    "id": 15,
    "name": "Legal Awareness Seminar",
    "date": "2025-02-05",
    "time": "02:00 PM",
    "venue": "Law College Hall",
    "department": "Law",
    "category": "technical",
    "description": "The Legal Awareness Seminar 2025 focuses on recent changes in civil and criminal law, featuring 350 delegates including law students, practicing attorneys, and legal professionals. This comprehensive 6-hour seminar includes 8 keynote presentations on legal reforms, civil rights, court procedures, and recent case precedents. Distinguished speakers include Judge Sarah Martinez from the Supreme Court, Attorney Michael Chen from the City Bar Association, and Dr. Legal Studies Professor from the National Law Institute. Students will gain insights into legal rights and obligations, judicial system reforms, and career opportunities in the legal profession. The seminar features 3 specialized discussion panels on labor law, corporate law, and consumer protection law, plus an exhibition of 25 student legal research posters. Special sessions cover emerging legal issues, international law applications, and legal technology innovations. The event aims to empower students with practical legal knowledge and encourage careers in the justice system through networking opportunities with legal professionals.",
    "organizer": "Law Faculty",
    "image": "https://romyjurado.com/wp-content/uploads/2021/11/what-is-a-civil-case-in-florida-980x605.png",
    "status": "completed",
    "registrationRequired": true,
    "capacity": 350,
    "attendees": 335
  },
  {
    "id": 16,
    "name": "Moot Court Competition",
    "date": "2025-09-12",
    "time": "09:30 AM",
    "venue": "Law Moot Court Hall",
    "department": "Law",
    "category": "technical",
    "description": "The Moot Court Competition 2025 is the most prestigious legal event of the year, providing law students with authentic courtroom experience through simulated legal proceedings. This intensive 3-day competition features 16 teams from 8 leading law schools nationwide. Each team of 4 members presents written legal briefs and oral arguments before a distinguished panel of 5 judges, including experienced judges, practicing attorneys, and law professors. The competition includes 4 rounds: preliminary rounds with 16 teams, quarterfinals with 8 teams, semifinals with 4 teams, and finals with 2 teams. Teams argue real-world cases involving civil law, criminal law, and constitutional issues. Substantial prizes include 1st place ($20,000), 2nd place ($15,000), 3rd place ($10,000 each for two teams), and 4 honorable mentions. Special recognition includes the 'Best Oral Advocate' and 'Best Written Brief' awards. The top 3 outstanding students receive internship opportunities at prestigious law firms and court chambers, providing valuable career advancement opportunities in the legal profession.",
    "organizer": "Law Faculty",
    "image": "https://www.lawof.in/wp-content/uploads/2019/09/Moot-Court-Competition_.jpg",
    "status": "upcoming",
    "registrationRequired": true,
    "capacity": 280,
    "attendees": 0
  },
  {
    "id": 17,
    "name": "Poetry Recitation Contest",
    "date": "2025-03-08",
    "time": "04:00 PM",
    "venue": "Language Lab",
    "department": "English",
    "category": "cultural",
    "description": "The Poetry Recitation Contest 2025 invites literature enthusiasts to showcase their talent in spoken word and creative expression, featuring 140 participants from various departments including literature students and poetry enthusiasts. This comprehensive 4-hour contest includes 3 categories: classical poetry (traditional forms, sonnets), contemporary poetry (free verse, prose poetry), and original composition performance. The judging panel consists of 5 literature experts, including renowned poet Sarah Martinez and Professor Literature from the National University. Participants will be evaluated based on expression, clarity, creativity, and emotional impact. The contest offers substantial prizes: 1st place ($5,000), 2nd place ($3,000 each for two winners), 3rd place ($2,000 each for three winners), and 5 honorable mentions. Special highlights include 3 outstanding participants receiving invitations to perform on the local radio program 'Voices of Poetry'. The event also features poetry workshops, book signings by guest poets, and networking opportunities with literary professionals and publishers.",
    "organizer": "English Department",
    "image": "https://podarpearlschool.org/wp-content/uploads/2022/06/ert.png",
    "status": "completed",
    "registrationRequired": false,
    "capacity": "No limit",
    "attendees": 450
  },
  {
    "id": 18,
    "name": "Literature Fest",
    "date": "2025-09-30",
    "time": "10:00 AM",
    "venue": "Auditorium",
    "department": "English",
    "category": "cultural",
    "description": "The Literature Fest 2025 is the largest cultural event of the year, spanning 3 days to celebrate books, writers, and the art of storytelling. This comprehensive festival brings together over 800 literature enthusiasts with 15 main events: 5 author talks with renowned writers, 4 panel discussions on modern literary trends, 3 live book reading sessions, and 3 theatrical adaptations of famous novels. Distinguished guests include bestselling author John Smith, poet Sarah Martinez, and literary translator Michael Chen. Students will perform 8 short plays adapted from classic works including 'The Great Gatsby', 'To Kill a Mockingbird', and '1984'. The festival features an exhibition of 100 rare books, 50 student creative writing manuscripts, and 20 posters on Vietnamese literary history. Special highlights include 5 creative writing workshops led by professional authors, providing students with opportunities to develop their writing skills and publish their first works. The fest creates an immersive literary experience with book signings, poetry slams, and networking opportunities with publishers and literary agents.",
    "organizer": "English Department",
    "image": "https://agimat.net/wp-content/uploads/2024/03/240318_Literary-Festival-at-Book-Fair_Banner.jpg",
    "status": "upcoming",
    "registrationRequired": false,
    "capacity": "No limit",
    "attendees": 450
  },
  {
    "id": 19,
    "name": "Environmental Summit",
    "date": "2025-05-18",
    "time": "09:00 AM",
    "venue": "Auditorium B",
    "department": "Environmental Science",
    "category": "technical",
    "description": "The Environmental Summit 2025 convenes over 600 delegates including students, researchers, policymakers, and representatives from 20 international environmental organizations. This comprehensive 8-hour summit features 6 main discussion panels on climate change, biodiversity loss, renewable energy, sustainable agriculture, green technology, and environmental policy. Distinguished speakers include Dr. Sarah Johnson from the National Environmental Institute, Professor David Wilson from Stanford University (USA) on solar energy innovations, and representatives from WWF Vietnam. The summit includes an exhibition of 50 student research posters, 8 student-led workshops on recycling, energy conservation, and wildlife protection. Special sessions cover emerging topics like 'Smart City Solutions', 'Organic Agriculture and Food Safety', and 'Waste Treatment Technologies'. The event features interactive demonstrations of green technologies, sustainable product showcases, and networking opportunities with environmental professionals. The summit's goal is to inspire actionable steps toward a more sustainable future through education, innovation, and collaborative action.",
    "organizer": "Environmental Science",
    "image": "https://as1.ftcdn.net/v2/jpg/08/29/57/14/1000_F_829571494_66RyO8yoN35eAV3aLhOK7xIO894f0V8l.jpg",
    "status": "completed",
    "registrationRequired": true,
    "capacity": 600,
    "attendees": 575
  },
  {
    "id": 20,
    "name": "Tree Plantation Drive",
    "date": "2025-08-10",
    "time": "07:30 AM",
    "venue": "Campus Grounds",
    "department": "Environmental Science",
    "category": "cultural",
    "description": "The Tree Plantation Drive 2025 is a comprehensive campus-wide green initiative led by 200 Environmental Science students, with over 1,000 volunteers from all departments participating. This intensive 6-hour campaign takes place at 5 locations throughout the campus, planting 500 trees including 200 shade trees (jacaranda, royal poinciana), 150 fruit trees (mango, guava, jackfruit), and 150 ornamental plants (bougainvillea, frangipani). The program includes 3 awareness sessions on the importance of reforestation, biodiversity conservation, and the role of trees in mitigating climate change. The event features 10 forestry experts from the Department of Natural Resources and Environment, 20 agricultural engineers, and 50 environmental guides. Special highlights include the 'Adopt a Tree' program where each student commits to caring for a tree for 2 years, with a tracking system to monitor growth and development. The campaign also includes soil testing, irrigation system installation, and educational signage about each tree species. This initiative aims to engage students in meaningful sustainability practices while creating a greener, more beautiful campus environment for future generations.",
    "organizer": "Environmental Science",
    "image": "https://www.aqi.in/blog/wp-content/uploads/2023/07/grow-more-trees-1600x900.jpg",
    "status": "completed",
    "registrationRequired": false,
    "capacity": "No limit",
    "attendees": 450
  }
]